app/controllers/account_users_controller.rb

  def create
    @account_user = AccountUser.new(account_user_params)
    respond_to do |format|
      if @account_user.save
---
INSERT INTO "account_users" ("account_id", "user_id", "privilege", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_id", 1], ["user_id", 2], ["privilege", "read"], ["created_at", "2020-12-04 22:26:33.092613"], ["updated_at", "2020-12-04 22:26:33.092613"]]

  def destroy
    @account_user.destroy
---
DELETE FROM "account_users" WHERE "account_users"."id" = $1  [["id", 1]]

  def set_account_user
    @account_user = AccountUser.find(params[:id])
---
SELECT  "account_users".* FROM "account_users" WHERE "account_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]