app/controllers/accounts_controller.rb

  def create
    @account = Account.new(account_params)
    @account.user_id = current_user.id
    respond_to do |format|
      if @account.save
---
INSERT INTO "account_users" ("account_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["account_id", 3], ["user_id", 2], ["created_at", "2020-12-31 23:09:09.912340"], ["updated_at", "2020-12-31 23:09:09.912340"]]
INSERT INTO "accounts" ("name", "account_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "accountn1"], ["account_type", "current1"], ["user_id", 2], ["created_at", "2020-12-03 17:05:52.932165"], ["updated_at", "2020-12-03 17:05:52.932165"]]

  def destroy
    @account.destroy
---
DELETE FROM "accounts" WHERE "accounts"."id" = $1  [["id", 2]]

  def set_transactions
    @transactions = TransactionHeader.where(account_id: @account.id)
---
SELECT "transaction_headers".* FROM "transaction_headers" WHERE "transaction_headers"."account_id" = $1  [["account_id", 1]]